<template>
  <div class="wrapper">
    <div class="profile">
      <br />
      <dl>
        <dt class="dt">Полное название:</dt>
        <dd>Кафедра ИУ-9 Теоретическая информатика и компьютерные технологии</dd>
        <br />
        <dt class="dt">Направление подготовки:</dt>
        <div class="flex-container">
          <div class="vl"></div>
          <dd>
            01.03.02 — Прикладная математика и информатика.
            <br />01.04.04 — Прикладная математика.
          </dd>
        </div>
        <br />
        <dd>
          Кафедра осуществляет подготовку бакалавров по направлению <span style="font-weight:bold">«Прикладная математика и информатика»</span> и магистров по направлению
          <span style="font-weight:bold">«Прикладная математика».</span>
          <br />
          <br />Мы готовим разработчиков математического и программного обеспечения для высокотехнологичных областей техники и современных информационных технологий с
          уклоном в высокоэффективное программирование, предусматривающее углубленные знания алгоритмов, технологий компиляции и оптимизации программного кода,
          особенностей создания многопоточных, параллельных и распределенных приложений.
          Учебные планы предусматривают фундаментальную математическую подготовку, близкую к базовой математической подготовке на физико-математических специальностях
          классических университетов. Дополнительно, студенты знакомятся с рядом предметных областей, в которых активно используются новейшие достижения математики
          и программирования, включая лингвистику, биоинформатику и молекулярное моделирование.
        </dd>
        <br />
        <dt class="dt">
          Особенности подготовки:
          <br />
        </dt>
        <ul>
          <li>Учебные планы по математике первых двух курсов близки к учебным планам общей математической подготовки механико-математического факультета и соответствуют учебным планам факультета ВМиК МГУ им. М.В. Ломоносова. Основные математические курсы читают выпускники и сотрудники механико-математического факультета МГУ.</li>
          <li>Усиленное изучение алгоритмов осуществляется с первых дней обучения.</li>
          <li>С первого курса вырабатывается практический навык быстрого и эффективного изучения языков и парадигм программирования.</li>
        </ul>
        <br />
        <dt class="dt">
          Отличия от аналогичных программ других вузов:
          <br />
        </dt>
        <ul>
          <li>Значительное влияние традиций инженерного образования МГТУ им. Н.Э. Баумана.</li>
          <li>Ориентация программы бакалавриата на системное программирование и конструирование компиляторов.</li>
          <li>Углублённая подготовка в области компьютерной лингвистики, био- и хемоинформатики в магистратуре.</li>
        </ul>
        <br />
        <dt class="dt">
          Отличия от других кафедр факультета ИУ:
          <br />
        </dt>
        <ul>
          <li>Углублённая математическая подготовка.</li>
          <li>Приоритет фундаментальной научной подготовки над общеинженерной.</li>
          <li>В несколько раз больший объём практических заданий по программированию.</li>
          <li>Широкое использование автоматизированной системы тестирования T-BMSTU, являющейся аналогом системы e-judge из олимпиадного программирования, но, в оличие от последней, специально приспособленной для учебного процесса и поддерживающей большее количество языков программирования.</li>
          <li>Ориентация на UNIX-подобные операционные системы.</li>
        </ul>
        <br />
        <dt
          class="dt"
        >Процесс обучения (курсовые и выпускные работы, НИР) и специализация выпускников кафедры базируется на следующих научных и производственных направлениях:</dt>
        <ul>
          <li>разработка уникальных алгоритмов, включая решение задач класса NP;</li>
          <li>создание новых языков программирования;</li>
          <li>автоматический анализ исходных текстов программ;</li>
          <li>символьные вычисления, компьютерная алгебра и системы автоматического доказательства;</li>
          <li>анализ архитектур и использования операционных систем, прикладного программного обеспечения на высокопроизводительных вычислительных установках;</li>
          <li>компьютерная лингвистика, включающая разнообразные задачи обработки текстов на естественных языках;</li>
          <li>разработка и системное обеспечение сложных информационных систем, со специальными алгоритмами обработки данных, включая геоинформационные, тестирующие и обучающие системы.</li>
        </ul>
      </dl>
    </div>
  </div>
</template>



<script>
export default {
  name: "Profile",
  components: {}
};
</script>


<style scoped lang="scss">
.wrapper {
  display: flex;
  justify-content: center;
  align-items: center;
}

.profile {
  max-width: 700px;
  display: flex;
  flex-direction: column;
  align-items: center;
  padding: 10px;
  margin-left: 10%;
  margin-right: 10%;

  .dt {
    font-weight: 700;
    font-size: 16pt;
    margin-bottom: 5px;
    margin-top: 5px;
  }

  dd {
    line-height: 18pt;
  }

  ul {
    display: block;
    list-style-type: disc;
    margin-top: 1em;
    margin-bottom: 1 em;
    margin-left: 0;
    margin-right: 0;
    padding-left: 40px;
    line-height: 18pt;
  }

  li {
    margin-bottom: 7px;
    margin-top: 10px;
    line-height: 18pt;
  }

  .vl {
    border-left: 4px solid #ffd04b;
    border-radius: 4px;
    margin-right: 10px;
  }

  .flex-container {
    display: flex;
  }
}
</style>
